{
    "title" : "A systematic review on the code smell effect", 
    "abstract" : "Context: Code smell is a term commonly used to describe potential problems in the design of software. The concept is well accepted by the software engineering community. However, some studies have presented divergent findings about the usefulness of the smell concept as a tool to support software development tasks. The reasons of these divergences have not been considered because the studies are presented independently. Objective: To synthesize current knowledge related to the usefulness of the smell concept. We focused on empirical studies investigating how smells impact the software development, the code smell effect. Method: A systematic review about the smell effect is carried out. We grouped the primary studies findings in a thematic map. Result: The smell concept does not support the evaluation of quality design in practice activities of software development. There is no strong evidence correlating smells and some important software development attributes, such as effort in maintenance. Moreover, the studies point out that human agreement on smell detection is low. Conclusion: In order to improve analysis on the subject, the area needs to better outline: (i) factors affecting human evaluation of smells; and (ii) a classification of types of smells, grouping them according to relevant characteristics.", 
    "research question" : [
        {
            "rq_id" : "1",
            "rq_type" :  "generic",
            "question" : "What are the themes of studies investigating the code smell effect?"
        },
        {
            "rq_id" : "2",
            "rq_type" :  "generic",
            "question" : "How similar/different are the experimental settings of studies investigating smell effect?"
        },
        {
            "rq_id" : "3",
            "rq_type" :  "generic",
            "question" : "Are the findings converging?"
        }],
    "criteria" : {
        "inclusion" : [
            {
                "ic_id" : "1",
                "criteria" : "The paper is written in English."
            },
            {
                "ic_id" : "2",
                "criteria" : "The paper comes from a journal, conference or workshop."
            },
            {
                "ic_id" : "3",
                "criteria" : "The paper has five pages or more."
            }],
        "exclusion" : [
            {
                "ec_id" : "1",
                "criteria" : "The paper is not from software engineering."
            },
            {
                "ec_id" : "2",
                "criteria" : "The paper is not addressing smell effect."
            },
            {
                "ec_id" : "3",
                "criteria" : "The paper is focused on evaluation of automatic detection tools and heuristics."
            },
            {
                "ec_id" : "4",
                "criteria" : "The paper is focused on refactoring issues."
            },
            {
                "ec_id" : "5",
                "criteria" : "The paper is focused on visualization tools."
            },
            {
                "ec_id" : "6",
                "criteria" : "The paper is focused on metrics for smells."
            },
            {
                "ec_id" : "7",
                "criteria" : "The paper is not focused on smells for code design."
            }]},
    "research query" : "smell OR \"design flaw\" OR disharmony OR \"code anomaly\" OR \"design anomaly\" OR anti-pattern) AND (experiment OR empirical OR survey OR ethnography OR \"action research\" OR \"exploratory analysis\" OR study OR controlled)"

}