{
    "title" : "Quality in model-driven engineering: a tertiary study", 
    "abstract" : "Model-driven engineering (MDE) is believed to have a significant impact in software quality. However, researchers and practitioners may have a hard time locating consolidated evidence on this impact, as the available information is scattered in several different publications. Our goal is to aggregate consolidated findings on quality in MDE, facilitating the work of researchers and practitioners in learning about the coverage and main findings of existing work as well as identifying relatively unexplored niches of research that need further attention. We performed a tertiary study on quality in MDE, in order to gain a better understanding of its most prominent findings and existing challenges, as reported in the literature. We identified 22 systematic literature reviews and mapping studies and the most relevant quality attributes addressed by each of those studies, in the context of MDE. Maintainability is clearly the most often studied and reported quality attribute impacted by MDE. Eighty out of 83 research questions in the selected secondary studies have a structure that is more often associated with mapping existing research than with answering more concrete research questions (e.g., comparing two alternative MDE approaches with respect to their impact on a specific quality attribute). We briefly outline the main contributions of each of the selected literature reviews. In the collected studies, we observed a broad coverage of software product quality, although frequently accompanied by notes on how much more empirical research is needed to further validate existing claims. Relatively, little attention seems to be devoted to the impact of MDE on the quality in use of products developed using MDE.", 
    "research question" : 
    {
        "rq1" : {
            "generic" : "What is the currently available information concerning quality in MDE, systematically aggregated by means of a SLR, or a SMS?", 
            "explanation" : "Our goal is to characterize the current state of the art in this research domain, providing readers with pointers for looking up additional information concerning each particular quality characteristic and how it relates to MDE.",
            "specific1" : "How many primary studies are included in these reviews?", 
            "specific2" : "What is the time span covered by these reviews?", 
            "specific3" : "Is the list of the included primary studies available?", 
            "specific4" : "Is the quality of the primary studies assessed? If so, how is this done?", 
            "explanation4" : "This assessment is often ad hoc, but can also follow guidelines, such as those in Kitchenham and Charters ([2007](https://link.springer.com/article/10.1007/s11219-016-9324-8#ref-CR18)).",
            "specific5" : "Who is the secondary study targeted to?", 
            "explanation5" : "The target audience can be made of researchers, practitioners, or both.", 
            "specific6" : "What kind of software engineering task is the secondary study aimed at?", 
            "explanation6" : "These include decision support, knowledge support, and scoping.", 
            "specific7" : "What is the object of study in the included secondary studies?", 
            "explanation7" : "Typically, this includes models, transformations, or the software process (at least one of these, although for several papers, more than one of these objects of study are addressed).", 
            "specific8" : "Which quality attributes are addressed in the secondary study?", 
            "explanation8" : "These include product quality and quality in use attributes, as defined by the ISO/IEC 25010:2011 standards (ISO/IEC [2011](https://link.springer.com/article/10.1007/s11219-016-9324-8#ref-CR17))."
        },
        "rq2" : {
            "generic" : "What is the current status of consolidation of data collected from different literature reviews covering quality in MDE and made available through published secondary studies?", 
            "explanation" : "Ideally, one of the potentially key benefits to be taken from literature reviews (in particular, from SLRs) is to be able to aggregate data collected independently in different studies."
        }, 
        "rq3" : {
            "generic" : "Who are the key players in consolidating knowledge on quality in MDE through literature surveys?", 
            "explanation" : "This question is of a demographic nature. Our goal is to characterize the community in this research domain.",
            "specific1" : "How many systematic reviews, including systematic literature reviews and mapping studies, addressing the topic of quality in MDE, are available?",
            "explanation1" : "This provides a quick overview on the liveliness of the community which is consolidating information on this research topic.", 
            "specific2" : "What is the origin of these reviews?", 
            "explanation2" : "This covers organizations and countries and is aimed at better understanding the extent to which quality in MDE is becoming a global concern.",
            "specific3" : "What is the impact of these reviews, in terms of citations?", 
            "explanation3" : "This will provide some insight on the \"popularity\" of this research topic."
        }
    }, 
    "criteria" : {
        "inclusion" : {
            "ic1" : "The paper is a peer-reviewed full paper.", 
            "ic2" : "The paper includes a literature review where the papers were included using a defined search process.", 
            "ic3" : "The paper is related to model-driven development, or engineering, and explicitly covers quality in that context.", 
            "ic4" : "The paper is written in English."
        }, 
        "exclusion" : {
            "ec1" : "The paper is not a peer-reviewed full paper.", 
            "ec2" : "The paper reviews primary studies following an undefined studies selection process.", 
            "ec3" : "The paper is out of scope.", 
            "ec4" : "The paper is not written in English.", 
            "ec5" : "The paper is subsumed by another paper which is already included in our literature review.",
            "ec6" : "The paper is a duplicate of another paper in the sample.", 
            "ec7" : "The paper does not include a secondary study."
        }
    }, 
    "research query" : "(\"model driven\" OR \"MDE\" OR \"MDD\") AND (\"systematic review\" OR \"literature review\" OR \"literature survey\" OR \"survey\" OR \"overview of research\" OR \"mapping study\" OR \"review\")"


}