{
    "title" : "A systematic review on the engineering of software for ubiquitous systems", 
    "abstract" : "Context: Software engineering for ubiquitous systems has experienced an important and rapid growth, however the vast research corpus makes it difficult to obtain valuable information from it.

    Objective: To identify, evaluate, and synthesize research about the most relevant approaches addressing the different phases of the software development life cycle for ubiquitous systems.
    
    Method: We conducted a systematic literature review of papers presenting and evaluating approaches for the different phases of the software development life cycle for ubiquitous systems. Approaches were classified according to the phase of the development cycle they addressed, identifying their main concerns and limitations.
    
    Results: We identified 128 papers reporting 132 approaches addressing issues related to different phases of the software development cycle for ubiquitous systems. Most approaches have been aimed at addressing the implementation, evolution/maintenance, and feedback phases, while others phases such as testing need more attention from researchers.
    
    Conclusion: We recommend to follow existing guidelines when conducting case studies to make the studies more reproducible and closer to real life cases. While some phases of the development cycle have been extensively explored, there is still room for research in other phases, toward a more agile and integrated cycle, from requirements to testing and feedback.", 
    "research question" : 
    {
        "rq1" : {
            "generic" : "What are the stages of the development life cycle of software for ubiquitous systems that have been mainly considered?"
        },
        "rq2" : {
            "generic" : "What are the main approaches that have been proposed for each of these stages?"
        }, 
        "rq3" : {
            "generic" : "What are the current limitations of such approaches?"
        }, 
        "rq4" : {
            "generic" : "What are the open issues to be further investigated in regard to the development of software for ubiquitous systems?"
        }
    }, 
    "criteria" : {
        "inclusion" : {
            "ic1" : "The paper is written in English.", 
            "ic2" : "The paper is a primary study and not secondary or tertiary study (i.e., not reviews).", 
            "ic3" : "The paper is not shorter than four pages.", 
            "ic4" : "The paper presents empirical research.", 
            "ic5" : "The paper is published in any of the sources selected for the manual search process."
        }, 
        "exclusion" : {
            "ec1" : "The paper's main focus is not on developing software for ubiquitous systems.", 
            "ec2" : "The publishing source is not considered relevant for the purpose of the review."
        }
    }, 
    "research query" : "(ubiquitous system OR pervasive system OR cyber-physical system OR ambient intelligence OR smart building OR smart home OR home automation) AND (software OR engineering OR software engineering)"

}